program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3404.16.1"}, {"coremlc-version", "3404.24.1"}, {"coremltools-component-torch", "2.7.1"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.3.0"}})]
{
    func main<ios15>(tensor<fp32, [2, 1024, 216]> magnitude) {
            tensor<int32, [1]> var_12_axes_0 = const()[name = tensor<string, []>("op_12_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<string, []> stft_mag_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("stft_mag_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [2, 1024, 216]> stft_mag_1_to_fp16 = cast(dtype = stft_mag_1_to_fp16_dtype_0, x = magnitude)[name = tensor<string, []>("cast_6")];
            tensor<fp16, [2, 1024, 216, 1]> var_12_cast_fp16 = expand_dims(axes = var_12_axes_0, x = stft_mag_1_to_fp16)[name = tensor<string, []>("op_12_cast_fp16")];
            tensor<int32, [4]> var_17 = const()[name = tensor<string, []>("op_17"), val = tensor<int32, [4]>([3, 0, 1, 2])];
            tensor<int32, [8]> tensor_pad_0 = const()[name = tensor<string, []>("tensor_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 0, 0, 296])];
            tensor<string, []> tensor_mode_0 = const()[name = tensor<string, []>("tensor_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp16, []> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 2, 1024, 216]> tensor_1_cast_fp16 = transpose(perm = var_17, x = var_12_cast_fp16)[name = tensor<string, []>("transpose_3")];
            tensor<fp16, [1, 2, 1024, 512]> tensor_cast_fp16 = pad(constant_val = const_2_to_fp16, mode = tensor_mode_0, pad = tensor_pad_0, x = tensor_1_cast_fp16)[name = tensor<string, []>("tensor_cast_fp16")];
            tensor<int32, []> var_36 = const()[name = tensor<string, []>("op_36"), val = tensor<int32, []>(0)];
            tensor<bool, []> stft_mag_interleave_0 = const()[name = tensor<string, []>("stft_mag_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 2, 1024, 512]> stft_mag_cast_fp16 = concat(axis = var_36, interleave = stft_mag_interleave_0, values = tensor_cast_fp16)[name = tensor<string, []>("stft_mag_cast_fp16")];
            tensor<int32, [4]> input_1_perm_0 = const()[name = tensor<string, []>("input_1_perm_0"), val = tensor<int32, [4]>([0, 1, 3, 2])];
            tensor<int32, []> var_51 = const()[name = tensor<string, []>("op_51"), val = tensor<int32, []>(1)];
            tensor<int32, [8]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 2, 1, 2])];
            tensor<string, []> input_3_mode_0 = const()[name = tensor<string, []>("input_3_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp16, []> const_5_to_fp16 = const()[name = tensor<string, []>("const_5_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 2, 512, 1024]> input_1_cast_fp16 = transpose(perm = input_1_perm_0, x = stft_mag_cast_fp16)[name = tensor<string, []>("transpose_2")];
            tensor<fp16, [1, 2, 515, 1027]> input_3_cast_fp16 = pad(constant_val = const_5_to_fp16, mode = input_3_mode_0, pad = input_3_pad_0, x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_5_strides_0 = const()[name = tensor<string, []>("input_5_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_5_dilations_0 = const()[name = tensor<string, []>("input_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_5_groups_0 = const()[name = tensor<string, []>("input_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [16, 2, 5, 5]> instruments_0_down1_conv_1_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_down1_conv_1_weight_to_fp16"), val = tensor<fp16, [16, 2, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [16]> instruments_0_down1_conv_1_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_down1_conv_1_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1728)))];
            tensor<fp16, [1, 16, 256, 512]> input_5_cast_fp16 = conv(bias = instruments_0_down1_conv_1_bias_to_fp16, dilations = input_5_dilations_0, groups = input_5_groups_0, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = input_5_strides_0, weight = instruments_0_down1_conv_1_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [16]> instruments_0_down1_act_0_running_mean_to_fp16 = const()[name = tensor<string, []>("instruments_0_down1_act_0_running_mean_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1856)))];
            tensor<fp16, [16]> instruments_0_down1_act_0_running_var_to_fp16 = const()[name = tensor<string, []>("instruments_0_down1_act_0_running_var_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1984)))];
            tensor<fp16, [16]> instruments_0_down1_act_0_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_down1_act_0_weight_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2112)))];
            tensor<fp16, [16]> instruments_0_down1_act_0_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_down1_act_0_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2240)))];
            tensor<fp16, []> var_45_to_fp16 = const()[name = tensor<string, []>("op_45_to_fp16"), val = tensor<fp16, []>(0x1.064p-10)];
            tensor<fp16, [1, 16, 256, 512]> input_7_cast_fp16 = batch_norm(beta = instruments_0_down1_act_0_bias_to_fp16, epsilon = var_45_to_fp16, gamma = instruments_0_down1_act_0_weight_to_fp16, mean = instruments_0_down1_act_0_running_mean_to_fp16, variance = instruments_0_down1_act_0_running_var_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<fp16, []> var_47_to_fp16 = const()[name = tensor<string, []>("op_47_to_fp16"), val = tensor<fp16, []>(0x1.998p-3)];
            tensor<fp16, [1, 16, 256, 512]> input_9_cast_fp16 = leaky_relu(alpha = var_47_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<int32, [8]> input_11_pad_0 = const()[name = tensor<string, []>("input_11_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 2, 1, 2])];
            tensor<string, []> input_11_mode_0 = const()[name = tensor<string, []>("input_11_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp16, []> const_6_to_fp16 = const()[name = tensor<string, []>("const_6_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 16, 259, 515]> input_11_cast_fp16 = pad(constant_val = const_6_to_fp16, mode = input_11_mode_0, pad = input_11_pad_0, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_13_strides_0 = const()[name = tensor<string, []>("input_13_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_13_dilations_0 = const()[name = tensor<string, []>("input_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_13_groups_0 = const()[name = tensor<string, []>("input_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 16, 5, 5]> instruments_0_down2_conv_1_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_down2_conv_1_weight_to_fp16"), val = tensor<fp16, [32, 16, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2368)))];
            tensor<fp16, [32]> instruments_0_down2_conv_1_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_down2_conv_1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28032)))];
            tensor<fp16, [1, 32, 128, 256]> input_13_cast_fp16 = conv(bias = instruments_0_down2_conv_1_bias_to_fp16, dilations = input_13_dilations_0, groups = input_13_groups_0, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = input_13_strides_0, weight = instruments_0_down2_conv_1_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [32]> instruments_0_down2_act_0_running_mean_to_fp16 = const()[name = tensor<string, []>("instruments_0_down2_act_0_running_mean_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28160)))];
            tensor<fp16, [32]> instruments_0_down2_act_0_running_var_to_fp16 = const()[name = tensor<string, []>("instruments_0_down2_act_0_running_var_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28288)))];
            tensor<fp16, [32]> instruments_0_down2_act_0_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_down2_act_0_weight_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28416)))];
            tensor<fp16, [32]> instruments_0_down2_act_0_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_down2_act_0_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28544)))];
            tensor<fp16, [1, 32, 128, 256]> input_15_cast_fp16 = batch_norm(beta = instruments_0_down2_act_0_bias_to_fp16, epsilon = var_45_to_fp16, gamma = instruments_0_down2_act_0_weight_to_fp16, mean = instruments_0_down2_act_0_running_mean_to_fp16, variance = instruments_0_down2_act_0_running_var_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<fp16, [1, 32, 128, 256]> input_17_cast_fp16 = leaky_relu(alpha = var_47_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<int32, [8]> input_19_pad_0 = const()[name = tensor<string, []>("input_19_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 2, 1, 2])];
            tensor<string, []> input_19_mode_0 = const()[name = tensor<string, []>("input_19_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp16, []> const_7_to_fp16 = const()[name = tensor<string, []>("const_7_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 32, 131, 259]> input_19_cast_fp16 = pad(constant_val = const_7_to_fp16, mode = input_19_mode_0, pad = input_19_pad_0, x = input_17_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_21_strides_0 = const()[name = tensor<string, []>("input_21_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_21_dilations_0 = const()[name = tensor<string, []>("input_21_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_21_groups_0 = const()[name = tensor<string, []>("input_21_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 32, 5, 5]> instruments_0_down3_conv_1_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_down3_conv_1_weight_to_fp16"), val = tensor<fp16, [64, 32, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28672)))];
            tensor<fp16, [64]> instruments_0_down3_conv_1_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_down3_conv_1_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(131136)))];
            tensor<fp16, [1, 64, 64, 128]> input_21_cast_fp16 = conv(bias = instruments_0_down3_conv_1_bias_to_fp16, dilations = input_21_dilations_0, groups = input_21_groups_0, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = input_21_strides_0, weight = instruments_0_down3_conv_1_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<fp16, [64]> instruments_0_down3_act_0_running_mean_to_fp16 = const()[name = tensor<string, []>("instruments_0_down3_act_0_running_mean_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(131328)))];
            tensor<fp16, [64]> instruments_0_down3_act_0_running_var_to_fp16 = const()[name = tensor<string, []>("instruments_0_down3_act_0_running_var_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(131520)))];
            tensor<fp16, [64]> instruments_0_down3_act_0_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_down3_act_0_weight_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(131712)))];
            tensor<fp16, [64]> instruments_0_down3_act_0_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_down3_act_0_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(131904)))];
            tensor<fp16, [1, 64, 64, 128]> input_23_cast_fp16 = batch_norm(beta = instruments_0_down3_act_0_bias_to_fp16, epsilon = var_45_to_fp16, gamma = instruments_0_down3_act_0_weight_to_fp16, mean = instruments_0_down3_act_0_running_mean_to_fp16, variance = instruments_0_down3_act_0_running_var_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [1, 64, 64, 128]> input_25_cast_fp16 = leaky_relu(alpha = var_47_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<int32, [8]> input_27_pad_0 = const()[name = tensor<string, []>("input_27_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 2, 1, 2])];
            tensor<string, []> input_27_mode_0 = const()[name = tensor<string, []>("input_27_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp16, []> const_8_to_fp16 = const()[name = tensor<string, []>("const_8_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 64, 67, 131]> input_27_cast_fp16 = pad(constant_val = const_8_to_fp16, mode = input_27_mode_0, pad = input_27_pad_0, x = input_25_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_29_strides_0 = const()[name = tensor<string, []>("input_29_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_29_dilations_0 = const()[name = tensor<string, []>("input_29_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_29_groups_0 = const()[name = tensor<string, []>("input_29_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 64, 5, 5]> instruments_0_down4_conv_1_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_down4_conv_1_weight_to_fp16"), val = tensor<fp16, [128, 64, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(132096)))];
            tensor<fp16, [128]> instruments_0_down4_conv_1_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_down4_conv_1_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(541760)))];
            tensor<fp16, [1, 128, 32, 64]> input_29_cast_fp16 = conv(bias = instruments_0_down4_conv_1_bias_to_fp16, dilations = input_29_dilations_0, groups = input_29_groups_0, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = input_29_strides_0, weight = instruments_0_down4_conv_1_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<fp16, [128]> instruments_0_down4_act_0_running_mean_to_fp16 = const()[name = tensor<string, []>("instruments_0_down4_act_0_running_mean_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(542080)))];
            tensor<fp16, [128]> instruments_0_down4_act_0_running_var_to_fp16 = const()[name = tensor<string, []>("instruments_0_down4_act_0_running_var_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(542400)))];
            tensor<fp16, [128]> instruments_0_down4_act_0_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_down4_act_0_weight_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(542720)))];
            tensor<fp16, [128]> instruments_0_down4_act_0_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_down4_act_0_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(543040)))];
            tensor<fp16, [1, 128, 32, 64]> input_31_cast_fp16 = batch_norm(beta = instruments_0_down4_act_0_bias_to_fp16, epsilon = var_45_to_fp16, gamma = instruments_0_down4_act_0_weight_to_fp16, mean = instruments_0_down4_act_0_running_mean_to_fp16, variance = instruments_0_down4_act_0_running_var_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<fp16, [1, 128, 32, 64]> input_33_cast_fp16 = leaky_relu(alpha = var_47_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<int32, [8]> input_35_pad_0 = const()[name = tensor<string, []>("input_35_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 2, 1, 2])];
            tensor<string, []> input_35_mode_0 = const()[name = tensor<string, []>("input_35_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp16, []> const_9_to_fp16 = const()[name = tensor<string, []>("const_9_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 128, 35, 67]> input_35_cast_fp16 = pad(constant_val = const_9_to_fp16, mode = input_35_mode_0, pad = input_35_pad_0, x = input_33_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<string, []> input_37_pad_type_0 = const()[name = tensor<string, []>("input_37_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_37_strides_0 = const()[name = tensor<string, []>("input_37_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> input_37_pad_0 = const()[name = tensor<string, []>("input_37_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_37_dilations_0 = const()[name = tensor<string, []>("input_37_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_37_groups_0 = const()[name = tensor<string, []>("input_37_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 128, 5, 5]> instruments_0_down5_conv_1_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_down5_conv_1_weight_to_fp16"), val = tensor<fp16, [256, 128, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(543360)))];
            tensor<fp16, [256]> instruments_0_down5_conv_1_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_down5_conv_1_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2181824)))];
            tensor<fp16, [1, 256, 16, 32]> input_37_cast_fp16 = conv(bias = instruments_0_down5_conv_1_bias_to_fp16, dilations = input_37_dilations_0, groups = input_37_groups_0, pad = input_37_pad_0, pad_type = input_37_pad_type_0, strides = input_37_strides_0, weight = instruments_0_down5_conv_1_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, [256]> instruments_0_down5_act_0_running_mean_to_fp16 = const()[name = tensor<string, []>("instruments_0_down5_act_0_running_mean_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2182400)))];
            tensor<fp16, [256]> instruments_0_down5_act_0_running_var_to_fp16 = const()[name = tensor<string, []>("instruments_0_down5_act_0_running_var_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2182976)))];
            tensor<fp16, [256]> instruments_0_down5_act_0_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_down5_act_0_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2183552)))];
            tensor<fp16, [256]> instruments_0_down5_act_0_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_down5_act_0_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2184128)))];
            tensor<fp16, [1, 256, 16, 32]> input_39_cast_fp16 = batch_norm(beta = instruments_0_down5_act_0_bias_to_fp16, epsilon = var_45_to_fp16, gamma = instruments_0_down5_act_0_weight_to_fp16, mean = instruments_0_down5_act_0_running_mean_to_fp16, variance = instruments_0_down5_act_0_running_var_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<fp16, [1, 256, 16, 32]> input_41_cast_fp16 = leaky_relu(alpha = var_47_to_fp16, x = input_39_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<int32, [8]> input_43_pad_0 = const()[name = tensor<string, []>("input_43_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 2, 1, 2])];
            tensor<string, []> input_43_mode_0 = const()[name = tensor<string, []>("input_43_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp16, []> const_10_to_fp16 = const()[name = tensor<string, []>("const_10_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 256, 19, 35]> input_43_cast_fp16 = pad(constant_val = const_10_to_fp16, mode = input_43_mode_0, pad = input_43_pad_0, x = input_41_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<string, []> input_45_pad_type_0 = const()[name = tensor<string, []>("input_45_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_45_strides_0 = const()[name = tensor<string, []>("input_45_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> input_45_pad_0 = const()[name = tensor<string, []>("input_45_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_45_dilations_0 = const()[name = tensor<string, []>("input_45_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_45_groups_0 = const()[name = tensor<string, []>("input_45_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 256, 5, 5]> instruments_0_down6_conv_1_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_down6_conv_1_weight_to_fp16"), val = tensor<fp16, [512, 256, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2184704)))];
            tensor<fp16, [512]> instruments_0_down6_conv_1_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_down6_conv_1_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8738368)))];
            tensor<fp16, [1, 512, 8, 16]> input_45_cast_fp16 = conv(bias = instruments_0_down6_conv_1_bias_to_fp16, dilations = input_45_dilations_0, groups = input_45_groups_0, pad = input_45_pad_0, pad_type = input_45_pad_type_0, strides = input_45_strides_0, weight = instruments_0_down6_conv_1_weight_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<string, []> x_1_pad_type_0 = const()[name = tensor<string, []>("x_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_1_strides_0 = const()[name = tensor<string, []>("x_1_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> x_1_pad_0 = const()[name = tensor<string, []>("x_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_1_dilations_0 = const()[name = tensor<string, []>("x_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x_1_groups_0 = const()[name = tensor<string, []>("x_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> x_1_has_output_shape_output_shape_0 = const()[name = tensor<string, []>("x_1_has_output_shape_output_shape_0"), val = tensor<int32, [4]>([1, 256, 19, 35])];
            tensor<fp16, [512, 256, 5, 5]> instruments_0_up1_0_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_up1_0_weight_to_fp16"), val = tensor<fp16, [512, 256, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8739456)))];
            tensor<fp16, [256]> instruments_0_up1_0_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_up1_0_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15293120)))];
            tensor<fp16, [1, 256, 19, 35]> x_1_has_output_shape_cast_fp16 = conv_transpose(bias = instruments_0_up1_0_bias_to_fp16, dilations = x_1_dilations_0, groups = x_1_groups_0, output_shape = x_1_has_output_shape_output_shape_0, pad = x_1_pad_0, pad_type = x_1_pad_type_0, strides = x_1_strides_0, weight = instruments_0_up1_0_weight_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("x_1_has_output_shape_cast_fp16")];
            tensor<int32, [4]> var_179_begin_0 = const()[name = tensor<string, []>("op_179_begin_0"), val = tensor<int32, [4]>([0, 0, 1, 0])];
            tensor<int32, [4]> var_179_end_0 = const()[name = tensor<string, []>("op_179_end_0"), val = tensor<int32, [4]>([1, 256, 17, 35])];
            tensor<bool, [4]> var_179_end_mask_0 = const()[name = tensor<string, []>("op_179_end_mask_0"), val = tensor<bool, [4]>([true, true, false, true])];
            tensor<fp16, [1, 256, 16, 35]> var_179_cast_fp16 = slice_by_index(begin = var_179_begin_0, end = var_179_end_0, end_mask = var_179_end_mask_0, x = x_1_has_output_shape_cast_fp16)[name = tensor<string, []>("op_179_cast_fp16")];
            tensor<int32, [4]> input_49_begin_0 = const()[name = tensor<string, []>("input_49_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1])];
            tensor<int32, [4]> input_49_end_0 = const()[name = tensor<string, []>("input_49_end_0"), val = tensor<int32, [4]>([1, 256, 16, 33])];
            tensor<bool, [4]> input_49_end_mask_0 = const()[name = tensor<string, []>("input_49_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 256, 16, 32]> input_49_cast_fp16 = slice_by_index(begin = input_49_begin_0, end = input_49_end_0, end_mask = input_49_end_mask_0, x = var_179_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<fp16, [1, 256, 16, 32]> input_51_cast_fp16 = relu(x = input_49_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<fp16, [256]> instruments_0_up1_3_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_up1_3_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15293696)))];
            tensor<fp16, [256]> instruments_0_up1_3_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_up1_3_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15294272)))];
            tensor<fp16, [1, 256, 16, 32]> input_53_cast_fp16 = batch_norm(beta = instruments_0_up1_3_bias_to_fp16, epsilon = var_45_to_fp16, gamma = instruments_0_up1_3_weight_to_fp16, mean = instruments_0_down5_act_0_running_mean_to_fp16, variance = instruments_0_down5_act_0_running_var_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<bool, []> input_55_interleave_0 = const()[name = tensor<string, []>("input_55_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 512, 16, 32]> input_55_cast_fp16 = concat(axis = var_51, interleave = input_55_interleave_0, values = (input_37_cast_fp16, input_53_cast_fp16))[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<string, []> x_3_pad_type_0 = const()[name = tensor<string, []>("x_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_3_strides_0 = const()[name = tensor<string, []>("x_3_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> x_3_pad_0 = const()[name = tensor<string, []>("x_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_3_dilations_0 = const()[name = tensor<string, []>("x_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x_3_groups_0 = const()[name = tensor<string, []>("x_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> x_3_has_output_shape_output_shape_0 = const()[name = tensor<string, []>("x_3_has_output_shape_output_shape_0"), val = tensor<int32, [4]>([1, 128, 35, 67])];
            tensor<fp16, [512, 128, 5, 5]> instruments_0_up2_0_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_up2_0_weight_to_fp16"), val = tensor<fp16, [512, 128, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15294848)))];
            tensor<fp16, [128]> instruments_0_up2_0_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_up2_0_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18571712)))];
            tensor<fp16, [1, 128, 35, 67]> x_3_has_output_shape_cast_fp16 = conv_transpose(bias = instruments_0_up2_0_bias_to_fp16, dilations = x_3_dilations_0, groups = x_3_groups_0, output_shape = x_3_has_output_shape_output_shape_0, pad = x_3_pad_0, pad_type = x_3_pad_type_0, strides = x_3_strides_0, weight = instruments_0_up2_0_weight_to_fp16, x = input_55_cast_fp16)[name = tensor<string, []>("x_3_has_output_shape_cast_fp16")];
            tensor<int32, [4]> var_201_begin_0 = const()[name = tensor<string, []>("op_201_begin_0"), val = tensor<int32, [4]>([0, 0, 1, 0])];
            tensor<int32, [4]> var_201_end_0 = const()[name = tensor<string, []>("op_201_end_0"), val = tensor<int32, [4]>([1, 128, 33, 67])];
            tensor<bool, [4]> var_201_end_mask_0 = const()[name = tensor<string, []>("op_201_end_mask_0"), val = tensor<bool, [4]>([true, true, false, true])];
            tensor<fp16, [1, 128, 32, 67]> var_201_cast_fp16 = slice_by_index(begin = var_201_begin_0, end = var_201_end_0, end_mask = var_201_end_mask_0, x = x_3_has_output_shape_cast_fp16)[name = tensor<string, []>("op_201_cast_fp16")];
            tensor<int32, [4]> input_57_begin_0 = const()[name = tensor<string, []>("input_57_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1])];
            tensor<int32, [4]> input_57_end_0 = const()[name = tensor<string, []>("input_57_end_0"), val = tensor<int32, [4]>([1, 128, 32, 65])];
            tensor<bool, [4]> input_57_end_mask_0 = const()[name = tensor<string, []>("input_57_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 128, 32, 64]> input_57_cast_fp16 = slice_by_index(begin = input_57_begin_0, end = input_57_end_0, end_mask = input_57_end_mask_0, x = var_201_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<fp16, [1, 128, 32, 64]> input_59_cast_fp16 = relu(x = input_57_cast_fp16)[name = tensor<string, []>("input_59_cast_fp16")];
            tensor<fp16, [128]> instruments_0_up2_3_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_up2_3_weight_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18572032)))];
            tensor<fp16, [128]> instruments_0_up2_3_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_up2_3_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18572352)))];
            tensor<fp16, [1, 128, 32, 64]> input_61_cast_fp16 = batch_norm(beta = instruments_0_up2_3_bias_to_fp16, epsilon = var_45_to_fp16, gamma = instruments_0_up2_3_weight_to_fp16, mean = instruments_0_down4_act_0_running_mean_to_fp16, variance = instruments_0_down4_act_0_running_var_to_fp16, x = input_59_cast_fp16)[name = tensor<string, []>("input_61_cast_fp16")];
            tensor<bool, []> input_63_interleave_0 = const()[name = tensor<string, []>("input_63_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 32, 64]> input_63_cast_fp16 = concat(axis = var_51, interleave = input_63_interleave_0, values = (input_29_cast_fp16, input_61_cast_fp16))[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<string, []> x_5_pad_type_0 = const()[name = tensor<string, []>("x_5_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_5_strides_0 = const()[name = tensor<string, []>("x_5_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> x_5_pad_0 = const()[name = tensor<string, []>("x_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_5_dilations_0 = const()[name = tensor<string, []>("x_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x_5_groups_0 = const()[name = tensor<string, []>("x_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> x_5_has_output_shape_output_shape_0 = const()[name = tensor<string, []>("x_5_has_output_shape_output_shape_0"), val = tensor<int32, [4]>([1, 64, 67, 131])];
            tensor<fp16, [256, 64, 5, 5]> instruments_0_up3_0_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_up3_0_weight_to_fp16"), val = tensor<fp16, [256, 64, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18572672)))];
            tensor<fp16, [64]> instruments_0_up3_0_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_up3_0_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19391936)))];
            tensor<fp16, [1, 64, 67, 131]> x_5_has_output_shape_cast_fp16 = conv_transpose(bias = instruments_0_up3_0_bias_to_fp16, dilations = x_5_dilations_0, groups = x_5_groups_0, output_shape = x_5_has_output_shape_output_shape_0, pad = x_5_pad_0, pad_type = x_5_pad_type_0, strides = x_5_strides_0, weight = instruments_0_up3_0_weight_to_fp16, x = input_63_cast_fp16)[name = tensor<string, []>("x_5_has_output_shape_cast_fp16")];
            tensor<int32, [4]> var_223_begin_0 = const()[name = tensor<string, []>("op_223_begin_0"), val = tensor<int32, [4]>([0, 0, 1, 0])];
            tensor<int32, [4]> var_223_end_0 = const()[name = tensor<string, []>("op_223_end_0"), val = tensor<int32, [4]>([1, 64, 65, 131])];
            tensor<bool, [4]> var_223_end_mask_0 = const()[name = tensor<string, []>("op_223_end_mask_0"), val = tensor<bool, [4]>([true, true, false, true])];
            tensor<fp16, [1, 64, 64, 131]> var_223_cast_fp16 = slice_by_index(begin = var_223_begin_0, end = var_223_end_0, end_mask = var_223_end_mask_0, x = x_5_has_output_shape_cast_fp16)[name = tensor<string, []>("op_223_cast_fp16")];
            tensor<int32, [4]> input_65_begin_0 = const()[name = tensor<string, []>("input_65_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1])];
            tensor<int32, [4]> input_65_end_0 = const()[name = tensor<string, []>("input_65_end_0"), val = tensor<int32, [4]>([1, 64, 64, 129])];
            tensor<bool, [4]> input_65_end_mask_0 = const()[name = tensor<string, []>("input_65_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 64, 128]> input_65_cast_fp16 = slice_by_index(begin = input_65_begin_0, end = input_65_end_0, end_mask = input_65_end_mask_0, x = var_223_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<fp16, [1, 64, 64, 128]> input_67_cast_fp16 = relu(x = input_65_cast_fp16)[name = tensor<string, []>("input_67_cast_fp16")];
            tensor<fp16, [64]> instruments_0_up3_3_running_mean_to_fp16 = const()[name = tensor<string, []>("instruments_0_up3_3_running_mean_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19392128)))];
            tensor<fp16, [64]> instruments_0_up3_3_running_var_to_fp16 = const()[name = tensor<string, []>("instruments_0_up3_3_running_var_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19392320)))];
            tensor<fp16, [64]> instruments_0_up3_3_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_up3_3_weight_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19392512)))];
            tensor<fp16, [64]> instruments_0_up3_3_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_up3_3_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19392704)))];
            tensor<fp16, [1, 64, 64, 128]> input_69_cast_fp16 = batch_norm(beta = instruments_0_up3_3_bias_to_fp16, epsilon = var_45_to_fp16, gamma = instruments_0_up3_3_weight_to_fp16, mean = instruments_0_up3_3_running_mean_to_fp16, variance = instruments_0_up3_3_running_var_to_fp16, x = input_67_cast_fp16)[name = tensor<string, []>("input_69_cast_fp16")];
            tensor<bool, []> input_71_interleave_0 = const()[name = tensor<string, []>("input_71_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 64, 128]> input_71_cast_fp16 = concat(axis = var_51, interleave = input_71_interleave_0, values = (input_21_cast_fp16, input_69_cast_fp16))[name = tensor<string, []>("input_71_cast_fp16")];
            tensor<string, []> x_7_pad_type_0 = const()[name = tensor<string, []>("x_7_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_7_strides_0 = const()[name = tensor<string, []>("x_7_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> x_7_pad_0 = const()[name = tensor<string, []>("x_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_7_dilations_0 = const()[name = tensor<string, []>("x_7_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x_7_groups_0 = const()[name = tensor<string, []>("x_7_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> x_7_has_output_shape_output_shape_0 = const()[name = tensor<string, []>("x_7_has_output_shape_output_shape_0"), val = tensor<int32, [4]>([1, 32, 131, 259])];
            tensor<fp16, [128, 32, 5, 5]> instruments_0_up4_0_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_up4_0_weight_to_fp16"), val = tensor<fp16, [128, 32, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19392896)))];
            tensor<fp16, [32]> instruments_0_up4_0_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_up4_0_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19597760)))];
            tensor<fp16, [1, 32, 131, 259]> x_7_has_output_shape_cast_fp16 = conv_transpose(bias = instruments_0_up4_0_bias_to_fp16, dilations = x_7_dilations_0, groups = x_7_groups_0, output_shape = x_7_has_output_shape_output_shape_0, pad = x_7_pad_0, pad_type = x_7_pad_type_0, strides = x_7_strides_0, weight = instruments_0_up4_0_weight_to_fp16, x = input_71_cast_fp16)[name = tensor<string, []>("x_7_has_output_shape_cast_fp16")];
            tensor<int32, [4]> var_245_begin_0 = const()[name = tensor<string, []>("op_245_begin_0"), val = tensor<int32, [4]>([0, 0, 1, 0])];
            tensor<int32, [4]> var_245_end_0 = const()[name = tensor<string, []>("op_245_end_0"), val = tensor<int32, [4]>([1, 32, 129, 259])];
            tensor<bool, [4]> var_245_end_mask_0 = const()[name = tensor<string, []>("op_245_end_mask_0"), val = tensor<bool, [4]>([true, true, false, true])];
            tensor<fp16, [1, 32, 128, 259]> var_245_cast_fp16 = slice_by_index(begin = var_245_begin_0, end = var_245_end_0, end_mask = var_245_end_mask_0, x = x_7_has_output_shape_cast_fp16)[name = tensor<string, []>("op_245_cast_fp16")];
            tensor<int32, [4]> input_73_begin_0 = const()[name = tensor<string, []>("input_73_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1])];
            tensor<int32, [4]> input_73_end_0 = const()[name = tensor<string, []>("input_73_end_0"), val = tensor<int32, [4]>([1, 32, 128, 257])];
            tensor<bool, [4]> input_73_end_mask_0 = const()[name = tensor<string, []>("input_73_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 32, 128, 256]> input_73_cast_fp16 = slice_by_index(begin = input_73_begin_0, end = input_73_end_0, end_mask = input_73_end_mask_0, x = var_245_cast_fp16)[name = tensor<string, []>("input_73_cast_fp16")];
            tensor<fp16, [1, 32, 128, 256]> input_75_cast_fp16 = relu(x = input_73_cast_fp16)[name = tensor<string, []>("input_75_cast_fp16")];
            tensor<fp16, [32]> instruments_0_up4_3_running_mean_to_fp16 = const()[name = tensor<string, []>("instruments_0_up4_3_running_mean_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19597888)))];
            tensor<fp16, [32]> instruments_0_up4_3_running_var_to_fp16 = const()[name = tensor<string, []>("instruments_0_up4_3_running_var_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19598016)))];
            tensor<fp16, [32]> instruments_0_up4_3_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_up4_3_weight_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19598144)))];
            tensor<fp16, [32]> instruments_0_up4_3_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_up4_3_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19598272)))];
            tensor<fp16, [1, 32, 128, 256]> u4_1_cast_fp16 = batch_norm(beta = instruments_0_up4_3_bias_to_fp16, epsilon = var_45_to_fp16, gamma = instruments_0_up4_3_weight_to_fp16, mean = instruments_0_up4_3_running_mean_to_fp16, variance = instruments_0_up4_3_running_var_to_fp16, x = input_75_cast_fp16)[name = tensor<string, []>("u4_1_cast_fp16")];
            tensor<bool, []> input_77_interleave_0 = const()[name = tensor<string, []>("input_77_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 64, 128, 256]> input_77_cast_fp16 = concat(axis = var_51, interleave = input_77_interleave_0, values = (input_13_cast_fp16, u4_1_cast_fp16))[name = tensor<string, []>("input_77_cast_fp16")];
            tensor<string, []> x_9_pad_type_0 = const()[name = tensor<string, []>("x_9_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_9_strides_0 = const()[name = tensor<string, []>("x_9_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> x_9_pad_0 = const()[name = tensor<string, []>("x_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_9_dilations_0 = const()[name = tensor<string, []>("x_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x_9_groups_0 = const()[name = tensor<string, []>("x_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> x_9_has_output_shape_output_shape_0 = const()[name = tensor<string, []>("x_9_has_output_shape_output_shape_0"), val = tensor<int32, [4]>([1, 16, 259, 515])];
            tensor<fp16, [64, 16, 5, 5]> instruments_0_up5_0_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_up5_0_weight_to_fp16"), val = tensor<fp16, [64, 16, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19598400)))];
            tensor<fp16, [16]> instruments_0_up5_0_bias_to_fp16 = const()[name = tensor<string, []>("instruments_0_up5_0_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19649664)))];
            tensor<fp16, [1, 16, 259, 515]> x_9_has_output_shape_cast_fp16 = conv_transpose(bias = instruments_0_up5_0_bias_to_fp16, dilations = x_9_dilations_0, groups = x_9_groups_0, output_shape = x_9_has_output_shape_output_shape_0, pad = x_9_pad_0, pad_type = x_9_pad_type_0, strides = x_9_strides_0, weight = instruments_0_up5_0_weight_to_fp16, x = input_77_cast_fp16)[name = tensor<string, []>("x_9_has_output_shape_cast_fp16")];
            tensor<int32, [4]> var_266_begin_0 = const()[name = tensor<string, []>("op_266_begin_0"), val = tensor<int32, [4]>([0, 0, 1, 0])];
            tensor<int32, [4]> var_266_end_0 = const()[name = tensor<string, []>("op_266_end_0"), val = tensor<int32, [4]>([1, 16, 257, 515])];
            tensor<bool, [4]> var_266_end_mask_0 = const()[name = tensor<string, []>("op_266_end_mask_0"), val = tensor<bool, [4]>([true, true, false, true])];
            tensor<fp16, [1, 16, 256, 515]> var_266_cast_fp16 = slice_by_index(begin = var_266_begin_0, end = var_266_end_0, end_mask = var_266_end_mask_0, x = x_9_has_output_shape_cast_fp16)[name = tensor<string, []>("op_266_cast_fp16")];
            tensor<int32, [4]> input_79_begin_0 = const()[name = tensor<string, []>("input_79_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1])];
            tensor<int32, [4]> input_79_end_0 = const()[name = tensor<string, []>("input_79_end_0"), val = tensor<int32, [4]>([1, 16, 256, 513])];
            tensor<bool, [4]> input_79_end_mask_0 = const()[name = tensor<string, []>("input_79_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 16, 256, 512]> input_79_cast_fp16 = slice_by_index(begin = input_79_begin_0, end = input_79_end_0, end_mask = input_79_end_mask_0, x = var_266_cast_fp16)[name = tensor<string, []>("input_79_cast_fp16")];
            tensor<fp16, [1, 16, 256, 512]> input_81_cast_fp16 = relu(x = input_79_cast_fp16)[name = tensor<string, []>("input_81_cast_fp16")];
            tensor<fp16, [16]> instruments_0_up5_3_running_mean_to_fp16 = const()[name = tensor<string, []>("instruments_0_up5_3_running_mean_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19649792)))];
            tensor<fp16, [16]> instruments_0_up5_3_running_var_to_fp16 = const()[name = tensor<string, []>("instruments_0_up5_3_running_var_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19649920)))];
            tensor<fp16, [16]> instruments_0_up5_3_weight_to_fp16 = const()[name = tensor<string, []>("instruments_0_up5_3_weight_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19650048)))];
